app/Http/Controllers/PostController.php

     public function index()
     {

          $PostFromDB = Post::all();
---
select * from `posts`

     public function create()
     {
          $UserFromDB = User::all();
---
select * from `users`

     public function store(Request $request)
     {
          $request->validate([
               'Title' => ['required', 'min:3'],
               'description' => ['required', 'min:5'],
               'PostCreator'=>['required','exists:posts,user_id']
          ]);
          Post::create([
               'Title' => $request->Title,
               'description' => $request->description,
               'user_id' => $request->PostCreator,

          ]);
---
insert into `posts` (`Title`, `description`, `user_id`, `updated_at`, `created_at`) values ('any thing', 'any thing', '1', '2025-05-04 12:11:48', '2025-05-04 12:11:48')